# PowerSwitch S4048-ON

> This page was last updated: *{{ git_revision_date_localized }}*

!!! info

    S4048-ON is a networking switch for campus aggregation and core switching 10 Gbps servers and 40 Gbps optical uplinks to the 40 Gbps switching fabric in the core.

    The S4048-ON has:

    - Forty-eight SFP+ ports for 1/10 Gbps transceivers
    - Six fixed QSFP+ optical ports for 40Gbps transceivers
    - Serial RS 232 and Micro-USB console ports
    - One out-of-band (OOB) RJ45 management port
    - LED display for the switch, fan, and power status

---

## Front View (I/O-side)

![I/O-side view](../../assets/GUID-9C32485B-D809-43BC-BC69-694387ABDD6A-low.jpg)

1. SFP+ ports
2. QSFP+ ports
3. USB Type-A storage port

## Rear View (PSU-side)

![PSU-side view](../../assets/GUID-C7F3A160-004F-48B8-B539-DC43637449DC-low.jpg)

1. Power supply unit 1
2. Fan module
3. Out-of-band management port
4. Power supply unit 2
5. RS-232 serial console port

## LED Behavior

![S4048â€“ON LEDs](../../assets/GUID-D011C2D2-DE17-41DB-8490-A5E9D3DEC0A4-low.jpg)

=== "1. Master LED"

    - **Off**: Switch is in Stacking Slave mode
    - **Solid green**: System is in Stacking Master or Standalone mode

=== "2. System LED"

    - **Solid green** : Normal operation
    - **Flashing green**: Booting
    - **Solid amber**: Critical system error
    - **Flashing amber**: Non-critical system error, fan failure, or power supply failure

=== "3. Power LED"

    - **Off**: No power
    - **Solid green**: Normal
    - **Solid amber**: POST is in process
    - **Flashing amber**: Power supply failed

=== "4. Fan LED"

    - **Solid green**: Fan powered and running at the expected RPM
    - **Solid amber**: Fan failed including incompatible airflow direction when you insert the PSU or fan trays with differing airflows

=== "5. Locator LED"

    - **Off**: Locator function is disabled
    - **Flashing blue**: Locator function is enabled

=== "6. SFP+ link/activity LEDs"

    - Standard activity/speed indicators

=== "7. Stack LED"

    - Green digit display: Stack ID

=== "8. USB port LED"

    . . .

=== "9. QSFP+ link/activity LEDs"

    - **Activity LED flashing amber**: One second on, one second off - port beacon.

## OS9 Network Operating System

??? info "Dell OS9 Terminology"

    `OOB Management Port`

    :   The out-of-band management port is a dedicated port for management traffic. It is not associated with any VLANs and is not affected by any VLAN configuration. The OOB management port is used for management traffic only. It cannot be used for data traffic.

    `Port-Channel`

    :   Dell's implementation of a LAG (Link Aggregation Group). A port-channel is a logical interface that is composed of multiple physical interfaces. The physical interfaces can be on the same switch or on different switches. The port-channel is configured with a single IP address and MAC address. The port-channel is used to increase bandwidth and provide redundancy.

    `Enhanced VLT (eVLT)`

    :   Combining two VLT domains. eVLT can operate in layer 2 and layer 3 modes. eVLT is also known as mVLT.

    `RPM`

    :   Route Processor Module. The RPM is the main CPU of the switch. It runs the OS9 operating system and is responsible for all of the control plane functions of the switch.

    `VLT Backup Link`

    :   The backup link monitors the connectivity between the VLT peer switches. The backup link sends configurable, periodic keep alive messages between the VLT peer switches. Dell recommends using the OOB management network connection for the VLT backup link. The backup destination is the IP address of the peer that is not the local switch.

    `VLT Interconnect (VLTi)`

    :   The link used to synchronize states between the VLT peer switches. It is formed by creating one or more port-channels (LAGs) between the VLT peers.

    `VLT Domain`

    :   This domain includes both the VLT peer devices, VLT interconnect, and all of the port channels in the VLT connected to the attached devices. It is also associated to the configuration mode that you must use to assign VLT global parameters.

    `VLT Peer Device`

    :   One of a pair of devices that are connected with the special port-channel known as the VLT interconnect (VLTi).

    `VTY`

    :   Virtual Teletype or "VTY", is a virtual port used to get Telnet or SSH access to a device. VTY is solely used for inbound connections. These connections are all virtual with no hardware associated with them.

### CLI Modes

=== "EXEC"

    - The default mode after login with the privilege level of 1. This mode allows you to view the system status, run diagnostic commands, and view system statistics. You cannot make configuration changes in this mode.
    - The prompt for this mode is the hostname followed by `>`. Example - `DellEMC> Hello world!`.

=== "EXEC Privilege"

    - Contains commands to view configurations, clear counters, manage configuration files, run diagnostics, and enable or disable debug operations. The privilege level is 15, which is unrestricted.
    - Enter this mode by using the `enable` command.
    - The prompt for this mode is the hostname followed by `#`. Example -`DellEMC# Hello world!`.

=== "CONFIGURATION"

    - This mode allows you to configure security features, time settings, set logging and SNMP functions, configure static ARP and MAC addresses, and set line cards on the system.
        - Beneathe this mode are several submodes that apply to interfaces, protocols and features. For example, `interface` mode allows you to configure interface settings, `ip` mode allows you to configure IP settings, and `vlan` mode allows you to configure VLAN settings.
    - Enter this mode by using the `configure` command.
    - The prompt for this mode is the hostname followed by `(conf)#`. Example - `DellEMC(conf)# Hello world!`.

To exit a mode or its sub-mode and return to the previous mode, use the `exit` command.

To return to the EXEC Privilege mode from any mode, use the `end` command.

To run an EXEC Privilege mode command from the CONFIGURE mode, precede the command with the `do` command. This is useful for running `show` commands or saving the configuration without exiting the CONFIGURE mode.

[*Reference*](https://www.dell.com/support/manuals/en-us/dell-emc-os-9/s4048-on-9.14.2.4-config/cli-modes?guid=guid-c2dacafb-b58b-43bb-a295-669a21dc2d18&lang=en-us)

!!! tip "Obtaining Help"

    Enter `?` after a command prompt to list all of the available keywords. Entering `?` after a partial keyword lists all of the keywords that begin with the specified letters. Entering a [space] and then `?` after a keyword lists all of the keywords that can follow the specified keyword.

### Accessing the CLI

The S4048-ON does not listen to any network out of the box, so you'll need to access the CLI via a console cable for initial configuration. The easiest way is to use the micro-usb port on the front of the device.

Download the [drivers](https://www.dell.com/support/home/en-us/drivers/driversdetails/?driverid=r5k9d) onto the device you'll be using for access and then connect to the switch using the following settings:

- Baud rate: 115200
- No parity
- 8 data bits
- 1 stop bits
- No flow control

### Setting the hostname

```shell
DellEMC> enable
DellEMC# configure
DellEMC(conf)# hostname Switch-A
Switch-A(conf)#
```

[*Reference*](https://www.dell.com/support/manuals/en-us/dell-emc-os-9/s4048-on-9.14.2.4-config/configuring-a-host-name?guid=guid-4fb6a556-a309-4d56-abfe-2fa6ccee1183&lang=en-us)

### OOB Management Interface Configuration

```shell
DellEMC# configure
DellEMC(conf)# interface ManagementEthernet 1/1    #(1)
DellEMC(conf-if-ma-1/1)# no ip address dhcp        #(2)
DellEMC(conf-if-ma-1/1)# ip address 10.1.1.1/24    #(3)
DellEMC(conf-if-ma-1/1)# no shutdown               #(4)
DellEMC(conf-if-ma-1/1)# management route 0.0.0.0/0 10.1.1.254
DellEMC(conf-if-ma-1/1)# exit
DellEMC(conf)# 
```

1. The `interface` command is used to enter interface configuration submode.
2. The `no` command is used to negate a command. In this case, we are negating the `ip address dhcp` command and essentially removing that setting from the interface.
3. Setting the IP address of the management interface
4. This enables the interface and keeps it enabled after a reboot.

[*Reference: Management Port IP*](https://www.dell.com/support/manuals/en-us/dell-emc-os-9/s4048-on-9.14.2.4-config/configure-the-management-port-ip-address?guid=guid-d18626b7-74dd-4a2b-a4b7-bb8a852386e5&lang=en-us)</br>
[*Reference: Management Route*](https://www.dell.com/support/manuals/en-us/dell-emc-os-9/s4048-on-9.14.2.4-config/configure-a-management-route?guid=guid-e615d634-8863-4c93-92d1-5b269fd756ab&lang=en-us)

### Configure a user for remote SSH accesss

Create user:

```shell
DellEMC(conf)# enable password <password>    #(1)
DellEMC(conf)# username <username> password <password> privilege 15    #(2)
DellEMC(conf)# ip ssh server enable
```

1. EXEC Privilege mode is unrestricted by default. Configure a password as a basic security measure.
2. The `privilege` level can range from 0-15. The default is 1 which only allows access to EXEC mode. Level 15 is this the highest and allows access to all commands and CLI modes.

Enable SSH:

```shell
DellEMC(conf)# ip ssh server enable
DellEMC(conf)# ip ssh server version 2
```

*For more info on managing remote access to the terminal, see [this section](#managing-access-to-terminal-lines)*

> Todo: Document crypto key gen and RSA password auth

[*Reference: `Enable Password`*](https://www.dell.com/support/manuals/en-us/dell-emc-os-9/s4048-on-9.14.2.4-config/configuring-the-enable-password?guid=guid-cf0ca3a8-65f4-4859-b058-ecb7c424f0ec&lang=en-us)</br>
[*Reference: Username and Password*](https://www.dell.com/support/manuals/en-us/dell-emc-os-9/s4048-on-9.14.2.4-config/configuring-a-username-and-password?guid=guid-5afd0af5-ceac-4a0c-b3c8-e14ee7bcddb4&lang=en-us)

### Configure time zone and NTP

```shell
DellEMC(conf)# clock timezone UTC -5
DellEMC(conf)# ntp server <ip>
DellEMC(conf)# show ntp associations
DellEMC(conf)# show ntp status
DellEMC(conf)# show clock
```

[*Reference*](https://www.dell.com/support/manuals/en-us/dell-emc-os-9/s4048-on-9.14.2.4-config/system-time-and-date?guid=guid-047210d7-7dae-4a6d-86df-37a79e8e8b9f&lang=en-us)

### Saving the running configuration

The running config contains the current system configuration. If you do not copy (save) the running config to the startup config, any changes that you made will be lost after a reboot.

Save the running config to the startup config on the internal flash:

```shell
DellEMC# copy running-config startup-config
```

Save the running config (or startup config) to an FTP server:

```shell
DellEMC# copy running-config ftp:// username:password@<hostip>/filepath/ filename
```

[*Reference*](https://www.dell.com/support/manuals/en-us/dell-emc-os-9/s4048-on-9.14.2.4-config/save-the-running-configuration?guid=guid-30740b60-fdc7-4980-b20e-06e195bbaf13&lang=en-us)

### Upgrading the Firmware

OS9 switches have two boot banks, A and B. It's good practice to upload new firmware into on boot bank and keep the old firmware in the other in case you need to roll back.

#### 1. Make a copy of the startup configuration

```shell
DellEMC> enable
DellEMC# copy startup-config tftp://10.1.1.25/OS9_Switch-A.conf
```

#### 2. Upload the new firmware to image B

```shell
DellEMC# upgrade system tftp://10.1.1.25/FTOS-SK-9.14.bin b: 
```

#### 3. Change active boot bank and reload

```shell
DellEMC# configure
DellEMC(conf)# boot system stack-unit 1 primary system b:
DellEMC(conf)# exit
DellEMC# reload
```

### Virtual Link Trunking (VLT)

!!! warning inline end "BE ADVISED..."

    As of 10/30/23 we have been unable to test and confirm these steps in a GNS3 virtual lab. 
    
    We will need to do some testing on the S4048 switches themselves and update this section when/where necessary.

!!! info "Feature Description"

    Virtual Link Trunking is Dell's implementation of MLAG (Multi-Chassis Link Aggregation). It allows you to create a port-channel (LAG) between two switches and have them act as one logical switch. This provides redundancy and load balancing. 

!!! note "For brevity, when a configuration step is identical for both VLT peers, I will only show CLI examples for one of the peers."

#### 1. Enable STP globally on *each* VLT peer

!!! tip

    Dell recommends, at least initially, to enable STP globally on each VLT peer. This is to prevent loops in the event of a misconfiguration.

=== "VLT Peer 1"

    ```shell
    VLT-1> enable
    VLT-1# configure
    VLT-1(conf)# protocol spanning-tree rstp
    VLT-1(conf-rstp)# no disable
    VLT-1(conf-rstp)# bridge-priority 4096
    VLT-1(conf-rstp)# exit
    ```

=== "VLT Peer 2"

    ```shell
    VLT-2> enable
    VLT-2# configure
    VLT-2(conf)# protocol spanning-tree rstp
    VLT-2(conf-rstp)# no disable
    VLT-2(conf-rstp)# bridge-priority 8192
    VLT-2(conf-rstp)# exit
    ```

#### 2. Configure the VLT interconnect (VLTi) between *each* of the peers

!!! note

    The VLTi may consist of any 10G or 40G ports, but a combination of 10G *and* 40G ports is not supported. Dell recommends forming the VLTi with at least 2 port-channels as best practice.

```shell
VLT-1(conf)# interface range FortyGigabitEthernet 1/49-1/50    #(1)
VLT-1(conf-if-range-fo-1/47,fo-1/48)# description "Member of port-channel 1000 for the VLT Interconnect"    #(2)
VLT-1(conf-if-range-fo-1/47,fo-1/48)# no shutdown
VLT-1(conf-if-range-fo-1/47,fo-1/48)# exit
VLT-1(conf)# interface port-channel 1000    #(3)
VLT-1(conf-if-po-1000)# description "VLT Interconnect"
VLT-1(conf-if-po-1000)# channel-member FortyGigabitEthernet 1/49    #(4)
VLT-1(conf-if-po-1000)# channel-member FortyGigabitEthernet 1/50
VLT-1(conf-if-po-1000)# no shutdown
VLT-1(conf-if-po-1000)# exit
```

1. That's right! The `interface range` command allows you to select multiple interfaces at once for configuration. We'll be using these interfaces for the VLTi.
2. The `description` command is really useful for labeling interfaces and port-channels, among other things. When using the the `show` command, the description will be displayed first. Its not required, but it's good practice.
3. Configuring a port-channel (LAG) for the VLTi. In OS9, the # can be anything from 1-2000. I chose 1000 because it aligns with the port-channel # that is automically reserved for the VLTi in OS10...and it's easy to remember.
4. Selecting the interfaces that will be used to form the port-channel.

*Repeat these steps on the other VLT peer.*

[*Reference*](https://www.dell.com/support/manuals/en-us/dell-emc-os-9/s4048-on-9.14.2.4-config/configuring-a-vlt-interconnect?guid=guid-882304c2-cca8-4554-a96b-2f5b0c5b7a72&lang=en-us)

#### 3. Enabling VLT and join switches to the VLT domain

=== "VLT Peer 1"

    ```shell
    VLT-1(conf)# vlt domain 1    #(1)
    VLT-1(conf-vlt-1)# back-up destination 10.1.1.2    #(2)
    VLT-1(conf-vlt-1)# peer-link port-channel 1000    #(3)
    VLT-1(conf-vlt-1)# primary-priority 1    #(4)
    VLT-1(conf-vlt-1)# exit
    ```

    1. The VLT domain requires an ID number (1-1000). Configure the same ID on the peer switch to allow for common peering.
    2. This is the OOB management IP address of VLT peer 2. You can optionally specify the time `interval`. The range is from 1 to 5 seconds. The default is 3 seconds.
    3. Configuring the port-channel that will be used as the VLTi.
    4. (Optional). The system elects a primary and secondary VLT device, but you can confugure the roles before the election process if you wish. The lowest value is elected as the primary (1-65535).

=== "VLT Peer 2"

    ```shell
    VLT-2(conf)# vlt domain 1
    VLT-2(conf-vlt-1)# back-up destination 10.1.1.1    #(1)
    VLT-2(conf-vlt-1)# peer-link port-channel 1000
    VLT-2(conf-vlt-1)# primary-priority 2
    VLT-2(conf-vlt-1)# exit
    ```

    1. The OOB management IP address of the VLT peer 1.

[*Reference*](https://www.dell.com/support/manuals/en-us/dell-emc-os-9/s4048-on-9.14.2.4-config/enabling-vlt-and-creating-a-vlt-domain?guid=guid-4f2e6faf-30b2-4eb3-aef0-d5457c1c33b2&lang=en-us)

#### 4. Configure the default VLT MAC address on each peer (Optional)

!!! info

    When you create a VLT domain, a VLT-system MAC address used for internal system operations is automatically created. However, you can explicitly configure the default MAC address for the VLT domain. Doing so can help minimize the time required for the VLT system to sync the default MAC address of the VLT domain on both peers when one peer reboots. The format is aaaa.bbbb.cccc.

```shell
VLT-1(conf)# vlt domain 1
VLT-2(conf-vlt-1)# system-mac mac-address 00:11:22:33:44:55
```

*Repeat these steps on the other VLT peer.*

[*Reference*](https://www.dell.com/support/manuals/en-us/dell-emc-os-9/s4048-on-9.14.2.4-config/reconfiguring-the-default-vlt-settings-optional?guid=guid-61b3dde6-6906-4147-a27a-becc917d6c21&lang=en-us)

#### 5. Confirm the state of the VLT domain

```shell
VLT-1# show vlt brief
VLT Domain Brief
------------------
Domain ID : 1
Role : Primary
Role Priority : 1
ICL Link Status : Up    #(1)
HeartBeat Status : Up
VLT Peer Status : Up
Version : 6(3)
Local System MAC address : 00:01:e8:8a:e9:91
Remote System MAC address : 00:01:e8:8a:e9:76
Remote system version : 6(3)
Delay-Restore timer : 90 seconds

Delay-Restore Abort Threshold : 60 seconds
Peer-Routing : Disabled
Peer-Routing-Timeout timer : 0 seconds
Multicast peer-routing timeout : 150 seconds
```

1. ICL stands for "[inter-chassis link](https://www.dell.com/support/kbdoc/en-us/000179606/powerstore-alerts-ethernet-switch-inter-chassis-link-peer-presence)". This is the VLTi.

#### 7. Connecting a VLT Domain to a TOR switch

To connect to an attached device, like another switch, configure the same port-channel ID number on each peer switch in the VLT domain. This will create a single logical link (LAG) between the VLT domain and the attached device.

```shell
VLT-1(conf)# interface port-channel 10
VLT-1(conf-if-po-10)# description "Upstream port-channel connected to SwitchName"
VLT-1(conf-if-po-10)# no shutdown
VLT-1(conf-if-po-10)# no ip address
VLT-1(conf-if-po-10)# switchport    #(1)
VLT-1(conf-if-po-10)# vlt-peer-lag port-channel 10    #(2)
VLT-1(conf-if-po-10)# exit
VLT-1(conf)# interface FortyGigabitEthernet 1/51
VLT-1(conf-if-te-1/51)# description "Member of port-channel 10 for upstream connection to SwitchName"
VLT-1(conf-if-te-1/51)# no shutdown
VLT-1(conf-if-te-1/51)# port-channel-protocol LACP    #(3)
VLT-1(conf-if-te-1/51-lacp)# port-channel 10 mode active    #(4)
```

1. The `switchport` command puts the port-channel in layer 2 mode.
2. The `vlt-peer-lag` command associates the port-channel to the corresponding port-channel in the VLT peer for the VLT connection to an dattached device.
3. Entering LACP configuration mode for the interface.
4. Add port-channel 10 and enable LACP.

*Repeat these steps on the other VLT peer.*

[*Reference 1*](https://www.dell.com/support/manuals/en-us/dell-emc-os-9/s4048-on-9.14.2.4-config/connecting-a-vlt-domain-to-an-attached-access-device-switch-or-server?guid=guid-99a5a114-5dbc-4286-b64f-c5e43c4edf26&lang=en-us) </br>
[*Reference 2*](https://infohub.delltechnologies.com/l/dell-emc-networking-with-isilon-front-end-deployment-and-best-practices-1/layer-2-topology-configurations-7/)

!!! note

    Don't forget to create a LAG on the attached device and configure LACP as well.

#### Things to consider

!!! quote "Dell"

    If the source is connected to an orphan (non-spanned, non-VLT) port in a VLT peer, the receiver is connected to a VLT (spanned) port-channel, and the VLT port-channel link between the VLT peer connected to the source and ToR is down, traffic is duplicated due to route inconsistency between peers. To avoid this scenario, Dell EMC Networking recommends configuring both the source and the receiver on a spanned VLT VLAN.

What I *think* this means is that if you have something like a server connected to a VLT domain via 2 independant NICs (No LAG), and something like an upstream TOR switch connected to the same VLT domain via a port-channel (LAG), and that port-channel link (one of them?) goes down, routing issues can arise. If that is the case, then its something we need to consider because that is how our network will be set up - No port-channels/LAGs between the servers and the VLT domain, but a port-channel/lag between the VLT domain and 3rd "access" switch on the wall (or top of rack..whever we put it).

[Specifying VLT Nodes in a PVLAN](https://www.dell.com/support/manuals/en-us/dell-emc-os-9/s4048-on-9.14.2.4-config/specifying-vlt-nodes-in-a-pvlan?guid=guid-ab6e056d-e4c7-4910-b807-b09102f1083b)</br>
[Configuring a VLT VLAN or LAG in a PVLAN](https://www.dell.com/support/manuals/en-us/dell-emc-os-9/s4048-on-9.14.2.4-config/configuring-a-vlt-vlan-or-lag-in-a-pvlan?guid=guid-fad07f16-bf47-45b1-a36d-58f3a75a82f8)

---

This [VLT Technical guide](https://i.dell.com/sites/content/business/large-business/merchandizing/en/Documents/Dell_Force10_S4810_VLT_Technical_Guide.pdf) contains some information for tuning various settings to achieve faster convergence. I haven't looked through much of it yet, but I did spot a line that said "If the network is not tuned, some failures can lead to outages up to 30 seconds. The proposed heavy tuning reduces that to around 2-3 seconds (inter-VLAN routing) or 200-300 milliseconds (Layer2)." **200-300 MILLISECONDS**.

### Uplink Failure Detection (UFD)

!!! info "Feature Description"

    Uplink failure detection (UFD) provides detection of the loss of upstream connectivity and, if used with network interface controller (NIC) teaming, automatic recovery from a failed link. A switch provides upstream connectivity for devices, such as servers. If a switch loses its upstream connectivity, downstream devices also lose their connectivity. However, the devices do not receive a direct indication that upstream connectivity is lost because connectivity to the switch is still operational. UFD allows a switch to associate downstream interfaces with upstream interfaces. When upstream connectivity fails, the switch disables the downstream links. Failures on the downstream links allow downstream devices to recognize the loss of upstream connectivity.

For example, as shown below, Switches S1 and S2 both have upstream upstream connectivity to Router R1 and downstream connectivity to the server. UFD operation is shown in Steps A through C:

- In Step A, the server configuration uses the connection to S1 as the primary path. Network traffic flows from the server to S1 and then upstream to R1.
- In Step B, the upstream link between S1 and R1 fails. The server continues to use the link to S1 for its network traffic, but the traffic is not successfully switched through S1 because the upstream link is down.
- In Step C, UFD on S1 disables the link to the server. The server then stops using the link to S1 and switches to using its link to S2 to send traffic upstream to R1.

![UFD Example](../../assets/GUID-CD4322F5-DE8B-4D1C-BFBB-D9B02DAC558F-low.jpg)

#### UFD and NIC Teaming

To implement a rapid failover solution, you can use uplink failure detection on a switch with network adapter teaming on a
server. For example, as shown previously, the switch/ router with UFD detects the uplink failure and automatically disables the
associated downstream link port to the server. To continue to transmit traffic upstream, the server with NIC teaming detects
the disabled link and automatically switches over to the backup link in order.

#### Configuring UFD

1. Create an uplink-state group and enable the tracking of upstream link on the switch/router.
2. Assign a port or port-channel to the uplink-state group as an upstream or downstream interface.
3. Configure the number of downstream links in the uplink-state group that will be disabled if one upstream link in the group goes down.
4. Enable auto-recovery so that UFD-disabled downstream ports in the uplink-state group come up when a disabled upstream port in the group comes back up.
5. (Optional) Disable upstream-link tracking without deleting the uplink-state group.

```shell
DellEMC(conf)# uplink-state-group 1    #(1)
DellEMC(conf-uplink-state-group-1)# upstream FortyGigabitEthernet 1/51
DellEMC(conf-uplink-state-group-1)# downstream TenGigabitEthernet 1/1
DellEMC(conf-uplink-state-group-1)# downstream disable links all
DellEMC(conf-uplink-state-group-1)# downstream auto-recover
DellEMC(conf-uplink-state-group-1)# no enable    #(2)
```

1. The uplink-state group ID can be any number from 1 to 16.
2. This is useful for testing/troubleshooting. UFD can be turned on or off without removing the config. Turn tracking back on with `enable`.

!!! tip

    UFD can be configured in reverse as well. Just assign upstream ports as downstream interfaces in the uplink-state group and vice versa.

[*Reference*](https://www.dell.com/support/manuals/en-us/dell-emc-os-9/s4048-on-9.14.2.4-config/configuring-uplink-failure-detection?guid=guid-2aab7b9f-0b01-4061-b9dc-62ab3f302688&lang=en-us)

### VLAN Configuration

#### Switchport mode

!!! info

    When a port is in `switchport` mode (Layer 2), it passes mlutiple VLANs, or one untagged VLAN. It cannot accept both untagged and tagged traffic.

To configure `switchport`:

```shell
DellEMC# configure
DellEMC(conf)# Interface TenGigabitEthernet 0/5
DellEMC(conf-if-te-0/5)# switchport
```

!!! note

    To configure switchport mode, make sure any existing configuration on the interface is removed. For instance, the system does not allow you to configure switchport on an interface that is assigned an IP address, as the interface is already in Layer 3 mode.

#### Hybrid switchport mode

!!! info

    In hybrid `switchport` mode, the interface may pass both untagged and tagged VLANs.

To configure hybrid `switchport`:

```shell
DellEMC# configure
DellEMC(conf)# Interface TenGigabitEthernet 0/5
DellEMC(conf-if-te-0/5)# portmode hybrid
DellEMC(conf-if-te-0/5)# switchport
```

#### Creating VLANs

To add a VLAN to an interface untagged, input the following commands:

```shell
DellEMC# configure
DellEMC(conf)# Interface Vlan 414
DellEMC(conf-if-vl-414)# untagged TenGigabitEthernet 0/5    #(1)
```

1. You can also add VLANs to port-channels - eg. `untagged port-channel 10`.

To add a VLAN to an interface tagged (802.1Q), input the following commands:

```shell
DellEMC(conf-if-vl-414)# tagged TenGigabitEthernet 0/9
```

To apply multiple VLANs to an interface:

```shell
DellEMC# configure
DellEMC(conf)# interface range Vlan 414 â€“ 515
% Warning: interface-range ignores Non-existing ports (not configured).    #(1)
```

1. This error message is stating that within the range of 414 to 515, only the VLANs we have already created are configured. This is useful for creating a link to a Trunk Cisco port. Interface range Vlan 2-4094 allows you to add all existing VLANs to an interface to simulate a Trunk port without creating excess configuration. This command does not create new VLANs.

To apply the VLAN to a range of interfaces:

```shell
DellEMC(conf-if-vl-414)# tagged te0/5-10
```

To remove the VLAN from the interface:

!!! note

    The `no tagged` and `no untagged` commands remove tagged or untagged interfaces from a port-based VLAN and places it in the default VLAN (1). You cannot use these commands in the Default VLAN. The only way to remove an interface from the default VLAN is to place the interface in default mode by using the `no switchport` command in INTERFACE mode. 

```shell
DellEMC(conf-if-vl-414)# no tagged te0/5-10
```

Useful `show` commands:

| Command                           | Description                                     |
| --------------------------------- | ----------------------------------------------- |
| `show vlan`                       | Shows the existing VLANs and their ports        |
| `show run interface te0/5`        | Shows configuration of Interface te0/5          |
| `show run interface vlan 414`     | Shows configuration of VLAN 414                 |
| `show interface switchport te0/5` | Shows the tagged and untagged VLANs on a port   |

[*Reference*](https://www.dell.com/support/kbdoc/en-us/000119270/dell-emc-networking-how-to-configure-vlans-and-associate-ports-to-vlans-on-os9-ftos)

### Debugging and Diagnostics

If the system restarts for some reason (automatically or manually), the `show system` command output includes the reason for the restart.

---

!!! abstract "ToDo: This needs more documentation."

The `hardware watchdog` command allows you to configure automatically rebooting a Dell EMC Networking OS switch/router with a single RPM that is unresponsive.

---

To receive periodic power updates, you must enable the following command: `enable optic-info-update interval`. When the system detects a genuine over-temperature condition, it powers off the line card. To recognize this condition, look for the following system messages:

```shell
CHMGR-2-MAJOR_TEMP: Major alarm: chassis temperature high (temperature reaches or exceeds threshold of [value]C)
CHMGR-2-TEMP_SHUTDOWN_WARN: WARNING! temperature is [value]C; approaching shutdown threshold of [value]C
```

To troubleshoot an over-temperature condition, use the following info:

1. Use the `show environment` commands to monitor the temperature levels.
2. Check air flow through the system.
3. After the software has determined that the temperature levels are within normal limits. you can re-power the card safely with the `power-on` command in EXEC mode.

---

To recognize an under-voltage condition, look for the following message:

`%CHMGR-1-CARD_SHUTDOWN: Major alarm: stack unit 2 down - auto-shutdown due to under voltage`

In response, the system first shuts down the PoE. IF the condtiion persists, the system shuts down the line cards then the RPMs.

To troubleshoot an uinder-voltage condition, check that the correct number of power supplies are installed and their Status light LEDs are lit.

[*Reference*](https://www.dell.com/support/manuals/en-us/dell-emc-os-9/s4048-on-9.14.2.4-config/debugging-and-diagnostics?guid=guid-3ee7236a-776d-411d-9c1b-0208901f4fbe&lang=en-us)

### File Management

!!! info

    Files can be stored on and accessed from various storage media including internal flash, external flash and remote file servers. You may already be familiar with many of the file managment commands as they are commonly used in unix based systems. File management commands are executed from the EXEC privilege mode.

To view file system information, use the `show file-systems` command:

```shell
DellEMC# show file-systems
      Size(b)     Free(b)      Feature      Type   Flags  Prefixes
   2368282624  2304512000        FAT32 USERFLASH      rw  flash:
            -           -  unformatted USERFLASH      rw  fcmfs:
    218103808    64708608      Unknown  NFSMOUNT      rw  nfsmount:
            -           -            -   network      rw  ftp:
            -           -            -   network      rw  tftp:
            -           -            -   network      rw  scp:
            -           -            -   network      rw  http:
            -           -            -   network      rw  https:
```

!!! tip " To enable the internal FTP server, use the `ftp-server enable` command."

---

To display the contents of the current directory, use the `dir` command:

```shell
DellEMC# dir

Directory of flash:

  1  drwx       4096   Jan 01 1980 00:00:00 +00:00 .  
  2  drwx       3580   Jul 18 2020 22:09:12 +00:00 ..  
  3  drwx       4096   Dec 10 2019 14:49:54 +00:00 TRACE_LOG_DIR  
  4  drwx       4096   Dec 10 2019 14:49:54 +00:00 CONFD_LOG_DIR  
  5  drwx       4096   Dec 10 2019 14:49:54 +00:00 CORE_DUMP_DIR  
  6  d---       4096   Dec 10 2019 14:49:54 +00:00 ADMIN_DIR  
  7  drwx       4096   Dec 10 2019 14:49:54 +00:00 RUNTIME_PATCH_DIR  
  8  -rwx          1   Jul 03 2020 22:54:24 +00:00 boots.txt  
  9  drwx       4096   Jul 14 2020 15:28:26 +00:00 CONFIG_TEMPLATE  
 10  -rwx          0   Jul 14 2020 15:28:56 +00:00 pdtrc.lo0  
 11  -rwx       4276   Jul 14 2020 15:29:04 +00:00 last-cold-st-config  
 12  -rwx       4435   Jul 03 2020 23:45:50 +00:00 startup-config  
 13  -rwx     314038   Jul 03 2020 23:45:54 +00:00 confd_cdb.tar.gz  
 14  -rwx         56   Jul 03 2020 23:45:54 +00:00 confd_cdb.tar.gz.version  
 15  -rwx          0   Jul 14 2020 15:28:26 +00:00 earlyCliParserDbg  

flash: 2368282624 bytes total (2304438272 bytes free)
```

---

To create a directory use the `mkdir` command and to remove use the `rmdir` command:

```shell
DellEMC# mkdir tmp_dir
DellEMC# dir tmp_dir
Directory of flash:/tmp_dir

  1  drwx       4096   Jul 18 2020 22:35:30 +00:00 .  
  2  drwx       4096   Jan 01 1980 00:00:00 +00:00 ..

DellEMC# rmdir tmp_dir
Proceed to remove the directory [confirm yes/no]: y

DellEMC# dir tmp_dir  
% Error: The specified file or directory does not exist.
```

---

To change directories, use the `cd` command. To show the current working directory, use the `pwd` command.

---

To copy one file to another location, use the `copy` command with the following syntax - `copy source-file-url destination-file-url`. Dell OS9 supports IPv4 and IPv6 addressing for FTP, HTTP, TFTP, and SCP.

=== "Local copy"

    ```shell
    DellEMC# copy startup-config startup-config.2
    !
    4435 bytes successfully copied
    ```

=== "From remote system to internal flash via SCP"

    ```shell
    DellEMC# copy scp://admin:password@192.168.101.2/firmware.bin  flash://firmware.bin
    !
    65059 bytes successfully copied
    ```

=== "From internal flash to remote system via SCP"

    ```shell
    DellEMC# copy running-config scp://admin:password@192.168.101.2/
    !
    4324 bytes successfully copied
    ```

---

To rename a file, use the `rename` command:

```shell
DellEMC# rename startup-config.2 start-config.3
```

---

To show the contents of a text file, use the `show file` command:

```shell
DellEMC# show file startup-config.3

! Version 9.13(0.1)
! Last configuration change at Fri Jul  3 23:43:25 2020 by default
! Startup-config last updated at Fri Jul  3 23:45:50 2020 by default
!
boot system stack-unit 1 primary system: A:
boot system stack....
```

---

To delete a file from local flash, use the `delete` command with the following syntax - `delete [flash://]filepath [no-confirm]`:

```shell
DellEMC# delete flash://startup-config.2
Proceed to delete startup-config.2 [confirm yes/no]: y

DellEMC# delete startup-config.3 no-confirm    #(1)
```

1. `no-confirm` skips user confirmation.

---

To save the output of a `show` command to a file, pipe it into the `save` command:

```shell
DellEMC# show command-history | save flash://command-history.txt
Start saving show command report .......

DellEMC# dir command-history.txt
Directory of flash:
  1  -rwx      76096   Jul 18 2020 22:30:16 +00:00 command-history.txt
```

---

To verify the integrity of a file, use the `verify` command using the following syntax - `verify {md5|sha256} file [hash-value]`:

```shell
DellEMC# verify md5 firmware.bin 4659f3b278b52fb09c7ed759b2f10474
MD5 hash VERIFIED for firmware.bin
```

[*Reference 1*](https://www.dell.com/support/manuals/en-us/dell-emc-os-9/s4048-on-9.14.2.4-config/configuration-file-management?guid=guid-ee703c5d-ff2c-4e01-8dcf-e2a7e49eb69b&lang=en-us)</br>
[*Reference 2*](https://gainanov.pro/eng-blog/sysad/dell-file-management/)

### Managing Access to Terminal Lines

You can access the system remotely and restrict access to the system by creating user profiles.

Terminal lines on the system provide different means of accessing he system. The console line connects you through the console port in the route processor modules (RPMs). The virtual terminal lines (VTYs) connect you through Telnet or SSH to the system.

There are 10 VTY lines, 0-9. Each of which have various methods to restrict access in. These depend on which authentification scheme you use â€” line, local, or remote.

| Authentification Method | VTY access-class support? | Username access-class support? | Remote authorization support? |
| ----------------------- | ------------------------- | ------------------------------ | ----------------------------- |
| Line                    | Yes                       | No                             | No                            |
| Local                   | Yes                       | Yes                            | No                            |
| TACACS+                 | Yes                       | No                             | Yes (ver 5.2.1.0 and later)   |
| RADIUS                  | Yes                       | No                             | Yes (ver 6.1.1.0 and later)   |

!!! Note "Dell recommends applying only standard ACLs to deny and permit access to VTY lines."

- Layer 3 ACLs deny all traffic that is not explicitly permitted, but in the case of VTY lines, an ACL with no rules does not deny traffic.
- You cannot use the `show ip accounting access-list` command to display the contents of an ACL that is applied only to a VTY line.
- To be able to filter access exclusively using either IPv4 or IPv6 rules, use either the `ipv4` or `ipv6` attribute along with the `access-class` `access-list-name` command. If no attribute is specified, the system applies the ACL to both IPv4 and IPv6 traffic. This is the generic way of configuring access restrictions.

#### VTY Line Local Authentication and Athorization

Retrieves the access class from the local database.

1. Create a username and password.
2. Assign an access class.
3. Enter a privilege level.

You can assign line authentication on a per-VTY basis; it is a simple password authentication, using an access-class as authorization. Configure local authentication globally and configure access classes on a per-user basis. Different access classes can be assigned by username as well. Until users attempt to log in, they do not know if they will be assigned a VTY line. This means that incoming users always see a login prompt even if you have excluded them from the VTY line with a deny-all access class. The access class is received from the local database and applied after the user identifies themselves.

!!! example "This example shows how to allow or deny a Telnet connection to a user on lines 0-9. No access class is configured for the VTY line."

    ```shell
    DellEMC(conf)# user gooduser password abc privilege 10 access-class permitall
    DellEMC(conf)# user baduser password abc privilege 10 access-class denyall
    DellEMC(conf)#
    DellEMC(conf)# aaa authentication login localmethod local
    DellEMC(conf)#
    DellEMC(conf)# line vty 0 9
    DellEMC(config-line-vty)# login authentication localmethod
    DellEMC(config-line-vty)# end
    ```

[*Reference*](https://www.dell.com/support/manuals/en-us/dell-emc-os-9/s4048-on-9.14.2.4-config/vty-line-local-authentication-and-authorization?guid=guid-4ed761e2-c9bb-4e49-96b2-fe4f82aa7287&lang=en-us)

#### VTY Line IP Filtering

IP access lists which permit or deny users are supported.

To apply an IP ACL on a VTY line, use the `access-class <access-list-name>` command.

!!! info

    If you already have configured generic IP ACL on a terminal line, then you cannot further apply IPv4 or IPv6 specific filtering on top of this configuration. You must first undo the existing configuration using the `no access-list-name` command.

!!! abstract "ToDo"

    Documentation needed for creating [`access-class` lists](https://www.dell.com/support/manuals/en-us/dell-emc-os-9/s4048-on-9.14.2.4-config/access-control-lists-acls?guid=guid-75e6f5c0-7f87-4a39-990b-cc307dc63863&lang=en-us). 

```shell
DellEMC(conf)# line vty 0 0    #(1)
DellEMC(config-line-vty)# access-class testv6deny ipv6
DellEMC(config-line-vty)# access-class testvpermit ipv4
```

1. In Dell's docs, it appears that they are always selecting a range of VTY lines, even when they are configuring a single line. In this example, VTY line 0 is being configured.

[*Reference*](https://www.dell.com/support/manuals/en-us/dell-emc-os-9/s4048-on-9.14.2.4-config/denying-and-permitting-access-to-a-terminal-line?guid=guid-23bcb9fb-55b9-45fb-888e-61f483255e50&lang=en-us)

#### VTY MAC-SA Filtering

MAC address access lists which permit or deny users are supported.

To apply a MAC ACL on a VTY line, use the same `access-class` command as IP ACLs.

!!! example

    ```shell
    DellEMC(conf)#mac access-list standard sourcemac
    DellEMC(config-std-mac)#permit 00:00:5e:00:01:01
    DellEMC(config-std-mac)#deny any
    DellEMC(conf)#
    DellEMC(conf)#line vty 0 9
    DellEMC(config-line-vty)#access-class sourcemac
    DellEMC(config-line-vty)#end
    ```

[*Referenece*](https://www.dell.com/support/manuals/en-us/dell-emc-os-9/s4048-on-9.14.2.4-config/vty-mac-sa-filter-support?guid=guid-c04088b6-725f-479d-9393-2a7895da6d7e&lang=en-us)

#### VTY Line Remote Authentication and Authorization

Retrieves the access-class from the VTY line and applies it to ALL users. The identity of the incoming user does not need to be known and the access-class is immediately applied. If the access-class is set to deny all or deny for the incoming subnet, the connection is closed without displaying the login prompt.

!!! example "This example shows how to deny incoming connections from subnet 10.0.0.0. The example uses TACACS+ as the auth mechanism."

    ```shell
    DellEMC(conf)#ip access-list standard deny10
    DellEMC(conf-ext-nacl)#permit 10.0.0.0/8
    DellEMC(conf-ext-nacl)#deny any
    DellEMC(conf)#
    DellEMC(conf)#aaa authentication login tacacsmethod tacacs+
    DellEMC(conf)#tacacs-server host 256.1.1.2 key Force10
    DellEMC(conf)#
    DellEMC(conf)#line vty 0 9
    DellEMC(config-line-vty)#login authentication tacacsmethod
    DellEMC(config-line-vty)#
    DellEMC(config-line-vty)#access-class deny10
    DellEMC(config-line-vty)#end
    ```
    (same applies for radius and line authentication)

[*Referenece*](https://www.dell.com/support/manuals/en-us/dell-emc-os-9/s4048-on-9.14.2.4-config/vty-line-remote-authentication-and-authorization?guid=guid-eebf1c00-0502-4e62-b7c2-1a73f89d1564&lang=en-us)

### Logging

Dell EMC Networking OS tracks changes in the system using event and error messages.

By default, these messages are logged:

- The internal buffer
- Console and terminal lines
- Any configured syslog servers

To display the internal logging buffer, use the `show logging` command. 

!!! abstract "ToDo"

    The internal buffer *can* be sent to a syslog server. Document this. <https://www.dell.com/support/manuals/en-us/dell-emc-os-9/s4048-on-9.14.2.4-config/send-system-messages-to-a-syslog-server?guid=guid-946901e8-4982-4043-90a1-1ec72d1ec25c&lang=en-us>

#### Audit and security logging

Audit and security logging can be enabled to monitor configuration changes or to determine if these changes affect the operation of the system in the network. Audit and security events are logged to a system log server, using the `logging extended` command in CONFIGURATION mode.

This command is available with or without RBAC (Role Based Access Control) enabled. If RBAC is enabled, the command is available only to system administrators.

=== "Audit logs"

    - User logins to the switch.
    - System events for network issues or system issues.
    - Users making configuration changes. The switch logs who made the configuration changes and the date and time of the change. However, each specific change on the configuration is not logged. Only that the configuration was modified is logged with the user ID, date, and time of the change.
    - Uncontrolled shutdown.

=== "Security logs"

    - Establishment of secure traffic flows, such as SSH.
    - Violations on secure flows or certificate issues.
    - Adding and deleting of users.
    - User access and configuration changes to the security and crypto parameters (not the key information but the crypto configuration).

#### Configuring secure connection to a syslog server

!!! abstract "ToDo"

    The steps to configure a UNIX system as a syslog server needs to be documented. May be possible to send to ELK.

    Ubuntu and other debian based distros use rsyslog: The line `local7.debugging /var/log/ftos.log` can be added to `/etc/rsyslog.conf `.

### Other useful things

#### Flow control for iSCSI

To avoid dropping packets during heavy utilization, enable flow control on the interfaces connected to iSCSI storage.

```shell
DellEMC(conf)# interface range Te1/1,2,3,4
DellEMC(conf-if-range-te-1/1,2,3,4)# flowcontrol rx on tx on
```

#### Auto lock configuration mode

You can configure the switch to automtically lock configuration mode for other users while you are making changes. This prevents other users from making changes while you are working. This is useful for preventing configuration conflicts.

```shell
configuration mode exclusive auto
```

#### Tracking login activity

By default, this is off. To enable it, use the following command:

```shell
login statistics enable
```

Displaying the login activity:

```shell
show login statistics
```

#### Limit concurrent sessions

```shell
login concurrent-session limit 1
```

#### Port Monitoring

Allows you to mirror traffic of one port to another. This is useful for analyzing traffic with a packet capture tool like Wireshark. You also have the ability to remotely monitor a port. In a remote port monitoring session, monitored traffic is tagged with a VLAN ID and switched on a user-defined, non-routable L2 VLAN. Allowing you to sniff from a distance.

```shell
DellEMC(conf)# monitor session 0
DellEMC(conf-mon-sess-0)# $source te 1/1 dest te 1/2 dir rx
```

#### Obscuring passwords and keys

I find it kind of odd that this isn't a default settings...

To obscure passwords and keys when the configuration is displayed, use the following command:

```shell
service obscure-passwords
```

## OS10 Network Operating System

!!! info

    I need to clean this section up a bit...references and more detail needed.

When labbing in GNS3, it takes quite a bit a time for the OS10 appliances to boot the first time. Be patient. Login with linuxadmin/linuxadmin and then logout. Skipping this will result in an "incorrect login" notice when trying to login to the default admin/admin. I have no idea why that is...

[This](https://sharifulhoque.blogspot.com/2021/07/stacking-switches-part-vi-dell-os10-vlt.html) was a helpful companion to the [Dell VLT docs](https://www.dell.com/support/manuals/en-us/dell-emc-smartfabric-os10/smartfabric-os-user-guide-10-5-3/configure-vlt?guid=guid-d858a76d-b0ed-46ce-a7dd-0624235d92bc&lang=en-us).

The switch I used for the VLT peers and access switch in this lab - "Dell OS10 S5248F-10.5.6.0.47".

> **NOTE** The default QEMU adapter count in the appliance's settings is 10. I tried to expand this to 57 get the full range of the appliance's interfaces (1/1/1-1/1/56), but the appliance failed to boot. I left it at 10 and just used the first 10 interfaces (1x mgmt, 9x eth).

### Setting the hostnames

VLT Peer 1

```shell
OS10# configure
OS10(config)# hostname VLT-1
VLT-1(config)#
```

VLT Peer 2

```shell
OS10# configure
OS10(config)# hostname VLT-2
VLT-2(config)#
```

Access switch

```shell
OS10# configure
OS10(config)# hostname ACCESS
ACCESS(config)#
```

### OOB management Interface Configuration

```shell
VLT-1# configure
VLT-1(config)# interface mgmt 1/1/1
VLT-1(conf-if-ma-1/1/1)# no ip address dhcp
VLT-1(conf-if-ma-1/1/1)# ip address 10.1.1.1/24
VLT-1(conf-if-ma-1/1/1)# exit
VLT-1(config)# exit
VLT-1# show running-configuration interface mgmt 1/1/1
!
interface mgmt1/1/1
 no shutdown
 no ip address dhcp
 ip address 10.1.1.1/24
 ipv6 address autoconfig
VLT-1#
```

> I set VLT-2 to 10.1.1.2

### Configure VLT

#### 1. Enable STP globally on each peer

```shell
VLT-1# configure
VLT-1(config)# spanning-tree mode rstp
```

#### 2. Create a VLT domain on each VLT peer

> The VLT domain requires an ID number (1-255). Configure the same ID on both peers.

```shell
VLT-1(config)# vlt-domain 1
VLT-1(conf-vlt-1)# exit
```

#### 3. Configure VLTi interfaces on each VLT peer

> Before you configure the VLTi on peer interfaces, remove each interface from L2 mode with `no switchport`. This is shown below.
>
> **NOTE** Dell did not mention any specific requirements for the interfaces used for VLTi. They just insist on deploying more than one as best practice.

```shell
VLT-1(config)# interface ethernet 1/1/8
VLT-1(conf-if-eth1/1/9)# no switchport
VLT-1(conf-if-eth1/1/9)# exit
VLT-1(config)# interface ethernet 1/1/9
VLT-1(conf-if-eth1/1/9)# no switchport
VLT-1(conf-if-eth1/1/9)# exit
VLT-1(config)# vlt-domain 1
VLT-1(conf-vlt-1)# discovery-interface ethernet 1/1/8-1/1/9
```

#### 4. (Optional) Manually configure the same default VLT MAC address on each VLT peer. This minimizes the time required to sync the default MAC of the VLT domain on both peers when one reboots

> While configuring a VLT MAC address, if the 8th bit of the MAC address is a 1, then the MAC address is considered to be a multicast MAC address. There are locally defined MAC addresses. For these addresses, the second least significant bit in the first byte must be a 1, which signifies a locally defined address.
>
>The correct MAC addresses must have xxxxxx10 bits set in the first octet, such as x2, x6, xA, xE, and so on.
>
> I fed that information to Chat-GPT to generate a MAC address for me.

```shell
VLT-1(conf-vlt-1)# vlt-mac C2:AC:50:08:FE:D9
```

#### 5. Configure VLT heartbeat backup link on each VLT peer

> Dell [recommends using the OOB management network connection for the VLT backup link](https://www.dell.com/support/manuals/en-us/dell-emc-smartfabric-os10/smartfabric-os-user-guide-10-5-3/configure-the-vlt-peer-liveliness-check?guid=guid-d140525e-19a1-4d53-8334-e7ec196a9da1&lang=en-us).
>
> The backup destination is the IP address of the peer that is not the local switch.

*VLT Peer 1*:

```shell
VLT-1(conf-vlt-1)# backup destination 10.1.1.2
```

*VLT Peer 2*:

```shell
VLT-2(conf-vlt-1)# backup destination 10.1.1.1
```

It was at this point that I linked eth 1/1/8-1/1/9 of each switch together. VLT Peer 1 immediately recognized both links and indicated that "VLT unit 2 is up" and that "VLT interconnect link between unit 1 and unit 2 is up". However, when I checked the status of the heartbeat link, it was down. This made sense. The backup links couldn't communicate with eachother because they weren't physically connected to a network. For the purposes of this lab, I directly connected the two interfaces together. In a production environment, the heart beat will traverse the management network the interfaces are connected to.

```shell
VLT-1(conf-vlt-1)# exit
VLT-1(config)# show vlt 1 backup-link
VLT Backup Link
------------------------
Destination                    : 10.1.1.2
Peer Heartbeat status          : Down
Heartbeat interval             : 30
Heartbeat timeout              : 90
Destination VRF                : default

**Connected the management interfaces of each VLT peer together**

VLT-1(config)#<165>1 2023-11-01T16:40:15.610812+00:00 VLT-1 dn_alm 687 - - Node.1-Unit.1:PRI [event], Dell (OS10) %VLT_HB_UP: VLT peer heartbeat link is up
VLT-1(config)# show vlt 1 backup-link
VLT Backup Link
------------------------
Destination                    : 10.1.1.2
Peer Heartbeat status          : Up    
Heartbeat interval             : 30
Heartbeat timeout              : 90
Destination VRF                : default
```

> **BE ADVISED** Upon this successful VLT-peer formation; the switches automatically created a non-configurable *port-channel 1000* interface consisting of our VLTi interfaces and *VLAN 4094*. Each are reserved for internal VLT communication.

#### 6. Configure VLT port channels (LAGs) between each VLT peer and attached devices

> Remember, *port channel 1000* is reserved. Port channel IDs can be any number between *1 to 999* or *1001 to 2000*.

```shell
VLT-1(conf-vlt-1)# exit
VLT-1(config)# interface port-channel 10
VLT-1(conf-if-po-10)# no shutdown
VLT-1(conf-if-po-10)# vlt-port-channel 10
VLT-1(conf-if-po-10)# exit
VLT-1(confg)# interface ethernet 1/1/1
VLT-1(conf-if-eth1/1/1)# channel-group 10 mode active
VLT-1(conf-if-eth1/1/1)# exit
VLT-1(config)#
```

A port-channel was also added to the access switch on interfaces eth 1/1/1 and 1/1/2...

#### 7. Verification

```shell
VLT-1(config)# exit
VLT-1# show vlt 1 vlt-port-detail
vlt-port-channel ID : 10
VLT Unit ID    Port-Channel      Status    Configured ports    Active ports
-------------------------------------------------------------------------------
* 1            port-channel10     up        1                   0
  2            port-channel10     up        1                   0
```

> The asterisk indicates what VLT peer I am currently logged into.

I started a ping from a client PC connected to the access switch to a NIC Teamed server connected to the VLT domain. I then suspended various links between the access switch, server and VLT domain. The pings dropped 1-2 times at most before resuming in each case.

I also killed each of the VLT peers. For each peer failure test, the pings initially dropped everyother 2 packets for about 90 seconds and then traffic resumed normally. That convergence time can be reduced by adjusting the heartbeat interval and timeout values. We would have to do some real world testing to determine what values would be appropriate for our environment . . . in GNS3, the vlt debug info showed that the failover completed in about 30 seconds.

### Misc Notes

List port groups and their members. This will show the full range, port grouping and speed of all the interfaces on the switch.

```shell
VLT-1# show port-group

Port-group            Mode           Ports     FEM
port-group1/1/1       Eth 25g-4x     1  2  3  4     -
port-group1/1/2       Eth 25g-4x     5  6  7  8     -
port-group1/1/3       Eth 25g-4x     9  10  11  12     -
port-group1/1/4       Eth 25g-4x     13  14  15  16     -
port-group1/1/5       Eth 25g-4x     17  18  19  20     -
port-group1/1/6       Eth 25g-4x     21  22  23  24     -
port-group1/1/7       Eth 25g-4x     25  26  27  28     -
port-group1/1/8       Eth 25g-4x     29  30  31  32     -
port-group1/1/9       Eth 25g-4x     33  34  35  36     -
port-group1/1/10      Eth 25g-4x     37  38  39  40     -
port-group1/1/11      Eth 25g-4x     41  42  43  44     -
port-group1/1/12      Eth 25g-4x     45  46  47  48     -
port-group1/1/13      Eth 100g-2x    49  50     -
port-group1/1/14      Eth 100g-2x    51  52     -
port-group1/1/15      Eth 100g-1x    53         -
port-group1/1/16      Eth 100g-1x    54         -
port-group1/1/17      Eth 100g-1x    55         -
port-group1/1/18      Eth 100g-1x    56         -

```

I misconfigured a port channel on the access switch connected to the VLT domain and needed to figure out how to remove/undo the settings. This is how I did it:

```shell
ACCESS(config)# interface ethernet 1/1/2
ACCESS(conf-if-eth1/1/2)# show configuration
!
interface ethernet1/1/2
 no shutdown
 channel-group 20 mode active
 no switchport
 flowcontrol receive off
ACCESS(conf-if-eth1/1/2)# no channel-group
ACCESS(conf-if-eth1/1/2)# show configuration
!
interface ethernet1/1/2
 no shutdown
 switchport access vlan 1
 flowcontrol receive off
```

**Orphan port** - I saw this in the Dell docs a few times an had no idea what it referred to. Whenever they use that term, they are making reference to a port that is NOT part of a VLT port-channel (LAG).

**Upstream member** - Typically the top of rack switch that connects to the VLT domain.

**Downstream member** - The device on the other side of the VLT domain...typically a server.

So, in our GNS3 lab . . . The switch labeled "Access" is the upstream member and the "Server" is the downstream member. The client PC is connected to the access switch via an orphan port.

**What it looks like in one go**:

```shell
OS10# configure terminal
OS10(config)# hostname VLT-2
VLT-2(config)# interface mgmt 1/1/1
VLT-2(conf-if-ma-1/1/1)# show configuration
!
interface mgmt1/1/1
 no shutdown
 ip address dhcp
 ipv6 address autoconfig
VLT-2(conf-if-ma-1/1/1)# no ip address dhcp
VLT-2(conf-if-ma-1/1/1)# ip address 10.1.1.2/24
VLT-2(conf-if-ma-1/1/1)# no shutdown
VLT-2(conf-if-ma-1/1/1)# copy running-configuration startup-configuration
VLT-2(conf-if-ma-1/1/1)# exit
VLT-2(config)# spanning-tree mode rstp
VLT-2(config)# vlt-domain domain 1
VLT-2(config)# vlt-domain 1
VLT-2(conf-vlt-1)# exit
VLT-2(config)# interface ethernet 1/1/8
VLT-2(conf-if-eth1/1/8)# no switchport
VLT-2(conf-if-eth1/1/8)# exit
VLT-2(config)# interface ethernet 1/1/9
VLT-2(conf-if-eth1/1/9)# no switchport
VLT-2(conf-if-eth1/1/9)# exit
VLT-2(config)# vlt-domain 1
VLT-2(conf-vlt-1)# discovery-interface ethernet 1/1/8-1/1/9
VLT-2(conf-vlt-1)# vlt-mac C2:AC:50:08:FE:D9
VLT-2(conf-vlt-1)# backup destination 10.1.1.1
VLT-2(conf-vlt-1)# exit
VLT-2(config)# interface port-channel 10
VLT-2(conf-if-po-10)# no shutdown
VLT-2(conf-if-po-10)# vlt-port-channel 10
VLT-2(conf-if-po-10)# exit
VLT-2(config)# interface ethernet 1/1/1
VLT-2(conf-if-eth1/1/1)# channel-group 10 mode active
VLT-2(conf-if-eth1/1/1)# exit
VLT-2(config)#
```
